# Data Merge

In [1]:
# import library
import pandas as pd

In [2]:
# create a dataset
data1 = {
    'id':[1,2,3],
    'name':['ali','fatima','atiq'],
    'age':[20,22,30]
}

In [3]:
# convert the data into dataframe
df1 = pd.DataFrame(data1)
df1.head()

   id    name  age
0   1     ali   20
1   2  fatima   22
2   3    atiq   30

In [4]:
# create second dataset
data2 = {
    'id':[1,2,3],
    'city':['karachi','lahore','islamabad'],
    'occupation':['engineer','doctor','teacher']
}

In [5]:
# convert the data into dataframe
df2 = pd.DataFrame(data2)
df2.head()

   id       city occupation
0   1    karachi   engineer
1   2     lahore     doctor
2   3  islamabad    teacher

## Here To Merge Data1 and Data2 using pandas function

In [6]:
df = pd.merge(df1,df2,on='id',how='inner')
df.head()

   id    name  age       city occupation
0   1     ali   20    karachi   engineer
1   2  fatima   22     lahore     doctor
2   3    atiq   30  islamabad    teacher

-----
# Concatenate

In [7]:
# create a dataset
dta1 = {'name':['atiq','hassan','hadi'],'age':[22,21,12]}
# 2nd datastset
dta2 = {'name':['sara','anum','sofya'],'age':[30,34,33]}
# 3rd dtaa set
dta3 = {'city':['peshawar','karachi','lohare'],'province':['sindth','punjab','kpk']}

In [8]:
# converting the data set into dataframe
a1 = pd.DataFrame(dta1)
a2 = pd.DataFrame(dta2)
a3 = pd.DataFrame(dta3)

In [9]:
a1.head()

     name  age
0    atiq   22
1  hassan   21
2    hadi   12

In [10]:
a2.head()

    name  age
0   sara   30
1   anum   34
2  sofya   33

In [11]:
a3.head()

       city province
0  peshawar   sindth
1   karachi   punjab
2    lohare      kpk

In [12]:
# now to cancatenate a1 with a2 on the base of row axis=0
concatenate_row = pd.concat([a1,a2])

In [13]:
# now to cancatenate a2 and and a3 on the bases of column axis = 1
concatenate_column = pd.concat([a2,a3],axis=1)

In [14]:
# here to print both functions
print(concatenate_row)
print('----------')
print(concatenate_column)

     name  age
0    atiq   22
1  hassan   21
2    hadi   12
0    sara   30
1    anum   34
2   sofya   33
----------
    name  age      city province
0   sara   30  peshawar   sindth
1   anum   34   karachi   punjab
2  sofya   33    lohare      kpk